// Task-2-7-b-ru.c : Этот файл содержит функцию 'main'.
// Выполнение программы начинается и заканчивается здесь.
//
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <locale.h>
#include <stdlib.h>
#include <stdbool.h>
#include <string.h>
#include <math.h>
#include <alg.h>

int main(int argc, char *argv[])
{
    int total_moves = 0; // Счётчик ходов
    int a, a1; // число текущего кода
    int b, b1; // число целевого кода
    int m = 0; // Количество цифр текущего кода
    int n = 0; // Количество цифр целевого кода
    // Установка русской локали для терминала Windows 11
    // 1-й способ. Выплнить внешнюю команду.
    system("chcp 65001 >nul");
    // 2 - й способ. Вызов библиотечной функции.
    setlocale(LC_ALL, "russian.65001");
    // Чтение входных данных
    // Ввод данных: целевой и текущий код
    // вводятся как четырехзначные числа
    printf("Введите текущий код: ");
    scanf("%d", &a);
    printf("Введите целевой код: ");
    scanf("%d", &b);
    n = 0;  // Количесво цифр текущего кода
    a1 = a;
    b1 = b;
    // Количество цифр текущего кода
    while (a1 > 0)
    {
        m += 1; // Вычислить количества цифр числа.
        a1 /= 10; // Число уменьшить в 10 раз.
    }
    // Количество цифр целевого кода
    while (b1 > 0)
    {
        n += 1; // Вычислить количества цифр числа.
        b1 /= 10; // Число уменьшить в 10 раз.
    }
    // Проверка на совпадение длины текущего и целевого кода
    // Если длина текущего кода не равна длине целевого
    // и оба кода не четырёхзначные, программа завершает работу.
    if ((m != 4) || (n != 4) || (m != n))
    {
        printf("Комбинация кодового замка должна быть 4 цифры.\r\n");
        printf("Текущий и целевой код должны быть одинаковой длины.");
        // Задержка вывода на экран до нажатия клавиши "Ввод"
        getchar();
        getc(stdin);
        return 0;
    }
    a1 = a;
    b1 = b;
    // Перебор цифр текущего и целевого кода
    while ((a1 > 0) && (b1 > 0))
    {
        int d1 = a1 % 10;  // Цифра текущего кода
        int d2 = b1 % 10;  // Цифра целевого кода
        int diff1 = abs(d1 - d2);  // разность цифр, прямой ход диска
        int diff2 = 10 - abs(d1 - d2);  // разность цифр, обратный ход диска
        // Мнинимальное число ходов - разность между каждой цифрой диска
        // в целевом коде и текущем коде замка сейфа
        total_moves += min(diff1, diff2);
        a1 /= 10;  // Переход к следующей цифре текущего кода
        b1 /= 10;  // Переход к следующей цифре целевого кода
    }
    // Вывод информации на экран
    printf("Текущий код: %d\r\n", a);
    printf("Целевой код: %d\r\n", b);
    printf("Мнинимальное число ходов: %d\r\n", total_moves);
    // Задержка вывода на экран до нажатия клавиши "Ввод"
    getchar();
    getc(stdin);
    return 0;
}

// Запуск программы: Ctrl + F5 или меню «Отладка» > «Запустить без отладки»
// Отладка программы: F5 или меню «Отладка» > «Запустить отладку»
// Советы по началу работы:
// 1. Используйте окно «Обозреватель решений» для добавления/управления файлами
// 2. Используйте окно «Обозреватель команд» для подключения к системе контроля версий
// 3. Используйте окно «Вывод», чтобы просмотреть результаты сборки и другие сообщения
// 4. Используйте окно «Список ошибок», чтобы просмотреть ошибки
// 5. Перейдите в меню «Проект» > «Добавить новый элемент», чтобы создать новые файлы кода, 
//    или в меню «Проект» > «Добавить существующий элемент», 
// чтобы добавить существующие файлы кода в проект