// Task-2-7-a-ru. Этот файл содержит функцию 'main'.
// Выполнение программы начинается и заканчивается здесь.
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <locale.h>
#include <stdlib.h>
#include <stdbool.h>
#include <string.h>
#include <math.h>

int main(int argc, char* args[])
{
    int total_moves = 0; // Счётчик ходов
    char a[80]; // строка текущего кода
    char b[80]; // строка текущего кода
    // Установка русской локали для терминала Windows 11
    // 1-й способ. Выплнить внешнюю команду.
    system("chcp 65001 >nul");
    // 2 - й способ. Вызов библиотечной функции.
    setlocale(LC_ALL, "russian.65001");
    // Чтение входных данных
    printf("Введите текущий код: ");
    fgets(a, 80, stdin);  // Ввод текущего кода
    printf("Введите целевой код: ");
    fgets(b, 80, stdin);  // Ввод целового кода
    int n_len1 = strlen(a);  // Вычислить длину 1-ой строки
    int n_len2 = strlen(b);  // Вычислить длину 2-ой строки
    // Проверка на совпадение длины текущего и целевого кода
    // Если длина текущего кода не равна длине целевого
    // и оба кода не четырёхзначные, программа завершает работу.
    if ((n_len1 != 4) || (n_len2 != 4) || (n_len1 != n_len2))
    {
        printf("Комбинация кодового замка должна быть 4 цифры.\r\n");
        printf("Текущий и целевой код должны быть одинаковой длины.\r\n");
        // Задержка вывода на экран до нажатия клавиши "Ввод"
        getc(stdin);
        return 0;
    }
    // Подсчет минимального количества ходов
    for (int i = 0; i < n_len1; i++)
    {
        int x = a[i]; // выделить цифру текущего кода 
        int y = b[i]; // // выделить цифру целевого кода 
        int diff1 = abs(x - y);  // разность цифр, прямой ход диска
        int diff2 = 10 - abs(x - y);  // разность цифр, обратный ход диска
        // Мнинимальное число ходов - разность между каждой цифрой диска
        // в целевом коде и текущем коде замка сейфа
        // Общее число ходов - ответ на вопрос
        total_moves += min(diff1, diff2);
    }
    // Вывод информации на экран
    printf("Текущий код: %s\r\n", a);
    printf("Целевой код: %s\r\n", b);
    printf("Мнинимальное число ходов: %d\r\n", total_moves);
    // Задержка вывода на экран до нажатия клавиши "Ввод"
    getc(stdin);
    return 0;
}

// Запуск программы: Ctrl + F5 или меню «Отладка» > «Запустить без отладки»
// Отладка программы: F5 или меню «Отладка» > «Запустить отладку»
// Советы по началу работы:
// 1. Используйте окно «Обозреватель решений» для добавления/управления файлами
// 2. Используйте окно «Обозреватель команд» для подключения к системе контроля версий
// 3. Используйте окно «Вывод», чтобы просмотреть результаты сборки и другие сообщения
// 4. Используйте окно «Список ошибок», чтобы просмотреть ошибки
// 5. Перейдите в меню «Проект» > «Добавить новый элемент», чтобы создать новые файлы кода, 
//    или в меню «Проект» > «Добавить существующий элемент», 
//    чтобы добавить существующие файлы кода в проект